n3tk0/ESP32_Logger/src/managers/ConfigManager.cpp
    // ── Fill any zero/empty fields that survived migration ────────────────────
    applyDefaults();

    Serial.printf("[CFG] Loaded v%u OK\n", config.version);
    return true;
}

// ============================================================================
// SAVE CONFIG
// ============================================================================
bool saveConfig() {
    config.magic   = CONFIG_STRUCT_MAGIC;
    config.version = CONFIG_VERSION;

    // Serialise with every other FS writer.  3 s timeout is long enough that
    // any legitimate FS op in flight will finish.  On timeout, return false —
    // the caller retries on the next opportunity; we must not write without
    // the lock (Pillar 1 of refactoring guidelines).
    MutexGuard g(fsMutex, pdMS_TO_TICKS(3000));
    if (!g.isLocked()) {
        DBGLN("Config save: fsMutex timeout — skipping write");
        return false;
    }

    // Crash-safe write: write to temp file, then rename over the real one.
    // If power is lost during write, the original config.bin remains intact.
    static const char* TMP_FILE = "/config.tmp";

    File f = LittleFS.open(TMP_FILE, "w");
    if (!f) {
        DBGLN("Failed to open config temp file");
        return false;
    }
    size_t written = f.write((uint8_t*)&config, sizeof(DeviceConfig));
    f.close();

    if (written != sizeof(DeviceConfig)) {
        DBGLN("Config write incomplete");
        LittleFS.remove(TMP_FILE);
        return false;
    }

    // Atomic rename: LittleFS rename overwrites the destination
    if (!LittleFS.rename(TMP_FILE, CONFIG_FILE)) {
        DBGLN("Config rename failed");
        return false;
    }

    // Pass 5 phase 2: shadow the subset of DeviceConfig that IModule adapters
    // track into /config/modules.json.  Run while fsMutex is still held so
    // saveAll's LittleFS writes are serialised (audit 1.9).
    moduleRegistry.saveAll(LittleFS);

    // g releases fsMutex here on return
    DBGLN("Config saved");
    return true;
}

// Public wrapper declared in ConfigManager.h.  Callers outside this TU get an
// idempotent "top up defaults" operation without needing the internal linkage.
void fillConfigDefaults() { applyDefaults(); }
